2021-06-27-why-eshell-part-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Why Eshell? - Part 2</title>
<meta name="author" content="Kasim Tuman">
	     <meta name="referrer" content="no-referrer">
	     <link href= "static/style.css" rel="stylesheet" type="text/css" />
	     <link rel="icon" href="static/favicon.ico">
	     <link rel="apple-touch-icon-precomposed" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleImage" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleColor" href="#0141ff">
	     <link rel="alternate" type="application/rss+xml"  title="RSS Feed for birkey.co" href="/rss.xml"
	     <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	     <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><br><center>
    <div style="display: inline-block; vertical-align:middle;">
<a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
</a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://www.birkey.co/resume.html">ABOUT</a> &nbsp;<a class="title" href="https://github.com/oneness">GITHUB</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a> &nbsp;<a class="title" href="https://paypal.me/ktuman">DONATE</a></div></div>
</center><br><br>
<div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">27 Jun 2021</div><h1 class="post-title"><a href="https://www.birkey.co/2021-06-27-why-eshell-part-2.html">Why Eshell? - Part 2</a></h1>
<p>
Among many reasons of why I use eshell as my main terminal, I listed
following in part 1 of my `Why Eshell?` series blog post. I am listing
it here for posterity:
</p>
<ol class="org-ol">
<li><b>Long running command notification and time</b></li>
<li><b>Cross session history</b></li>
<li><b>Interactive ido completion</b></li>
<li><b>Unified interface (shell prompt buffer as regular emacs buffer)</b></li>
<li><b>Plan9 Style Shell prompt (Think of it as bash REPL)</b></li>
<li><b>Multiple terminal management</b></li>
<li><b>Super charge bash with elisp</b></li>
<li><b>Eshell aliases that puts bash aliases to shame :)</b></li>
</ol>
<p>
I addressed first point here: <a href="https://www.birkey.co/2021-06-20-why-eshell-part-1.html">notification and time</a>. Let me address
second point, which is sharing eshell history across many terminal
sessions.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(defvar keshell-history-global-ring nil
  "The history ring shared across Eshell sessions.")

(defun keshell-hist-use-global-history ()
  "Make Eshell history shared across different sessions."
  (unless keshell-history-global-ring
    (when eshell-history-file-name
      (eshell-read-history nil t))
    (setq keshell-history-global-ring
	  (or eshell-history-ring (make-ring eshell-history-size))))
  (setq eshell-history-ring keshell-history-global-ring))
;; Following hook enables it
(add-hook 'eshell-mode-hook 'keshell-hist-use-global-history)
;; Following removes the hook
(remove-hook 'eshell-mode-hook 'keshell-hist-use-global-history)
</pre>
</div>
<p>
After evaluating above 12 lines of elisp, you will have a list that
holds all the eshell entries across sessions, which you can persist
into a history file (just uses bash history file) and can even share
it across machines over network. This opens up a whole new
possibilities of completions, deduplication and multiple eshell
buffer management goodness, which I will cover in the next few parts
of `Why Eshell?` posts. So stay tuned and happy eshelling!
</p>
<div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-eshell.html">eshell</a> <a href="https://www.birkey.co/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br><center>
	   <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
